import React from "react"
import './style/index.scss'

const About: React.FC = () => {
    return (
        <div className="container">
            <div className="image-logo-about">
                <img src={require('../../assets/logo.png')}/>
            </div>
            <div className="text-content-about">
                <p>
                    <b>Війська́ зв'язку́</b> — вид спеціальних військ, які призначені для забезпечення зв'язку і управління військами. У збройних силах більшості країн частини чи підрозділи зв'язку входять до складу всіх родів військ.

                    Війська зв'язку складаються з частин, вузлів зв'язку, вузлових та лінійних підрозділів, підрозділів постачання, ремонту та інших організаційних формувань зв'язку.
                </p> 
                <p>
                    <b>Система зв'язку</b>  — являє собою сукупність взаємопов'язаних та узгоджених за завданнями щодо забезпечення зв'язком вузлів і ліній зв'язку різного призначення, створюваних (чи розгорнутих на місцевості) для вирішення завдань забезпечення управління військами.

                    Система зв'язку повинна забезпечувати: своєчасний і безпечний обмін інформацією між пунктами управління з високим ступенем достовірності при веденні бойових дій із застосуванням як ядерної та високоточної зброї, так і звичайних засобів ураження; найбільш повне використання технічних можливостей усіх наявних засобів зв'язку; високу захищеність каналів зв'язку від радіоподавлення противника.

                    Основою системи зв'язку є вузли зв'язку пунктів управління та лінії зв'язку, побудовані (розгорнуті) між ними.

                    Вузли зв'язку пунктів управління забезпечують обмін всіма видами документованої інформації та ведення переговорів в процесі управління військами.
                </p>
            </div>
        </div>
    ) 
}

export default About